Page({

  /**
   * 页面的初始数据
   */
  data: {
    helplist: [{ name: 'name1', title: '关于签到的几点提醒', content: '1.基于地理位置的即时签到方式，老师或辅导员发起签到后十分钟之内签到有效，超过时间则不能签到。2.学生点击签到后提示签到成功即成功，当时的签到记录在该轮签到结束之后才可查看到签到记录，请稍安勿躁。3.若未能一次签到成功，可多试几次，实在成功不了，可向老师说明情况并联系我们进行解决，联系方式见个人中心' },{ name: 'name2', title: '关于微信绑定账号', content: '本小程序登录后会自动将账号和微信进行绑定，下次启动小程序将自动进行登录，故请慎重选择账号进行登录。有任何绑定问题，可联系我们进行申诉解绑。' }]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {
    
  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {
    
  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {
    
  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {
    
  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {
    
  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {
    
  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {
    
  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {
    
  }
})